УТ_для_edt/src/Documents/смартПредварительнаяТаможеннаяДекларацияИмпорт/смартПредварительнаяТаможеннаяДекларацияИмпорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартПредварительнаяТаможеннаяДекларацияИмпорт</name>
  <comment>#5067 смарт: Тимофеева 03.12.2025 / Таможенная декларация. Соответствие номенклатуры</comment>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <registerRecords>InformationRegister.смартСоответствияТаможенныхОписаний</registerRecords>
  <attributes>
    <name>ВариантОформления</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Графа 8 ДТ &quot;Получатель&quot;</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Графа 2 ДТ &quot;Отправитель/Экспортер&quot;</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.смартСтатусыПредварительныхТаможенныхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйСбор</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСбор</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовСбор</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйШтраф</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовШтраф</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовШтраф</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <type>
      <types>EnumRef.ПорядокРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДекларации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПоставщика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <type>
      <types>EnumRef.ПорядокОплатыПоСоглашениям</types>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>CatalogRef.смартГрузы</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЗапчастиГарантийные</name>
    <comment>//смарт:ММ 221 18.07.2021</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлДекларации</name>
    <type>
      <types>CatalogRef.смартПредварительнаяТаможеннаяДекларацияИмпортПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>НомерРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <comment>Графа 45 ДТ &quot;Таможенная стоимость&quot;</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаПошлины</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <comment>Графа 47 ДТ &quot;Исчисление платежей&quot;</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Графа 47 ДТ &quot;Исчисление платежей&quot;</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <comment>Вспомогательное поле для облегчения заполнения склада в товарах</comment>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеТоваров</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НомерРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПошлины</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляСФ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПоступления</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПоДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПоДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПоДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияПоДекларации</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныеНомераПоДекларации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭДПоДекларации</name>
      <type>
        <types>CatalogRef.КлассификаторТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособСопоставления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <comment>#7668 смарт: Тимофеева 30.07.2026 / Назначение в ПТД</comment>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DefinedType.ОбъектРасчетовСПоставщиками</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСтатусыПредварительныхТаможенныхДеклараций/смартСтатусыПредварительныхТаможенныхДеклараций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПредварительныхТаможенныхДеклараций</name>
  <comment>#5067 смарт: Тимофеева 03.12.2025 / Таможенная декларация. Соответствие номенклатуры</comment>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>СопоставлениеНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НоменклатураСопоставлена</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеРасчетов</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартПредварительнаяТаможеннаяДекларацияИмпорт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	//Документы.ТаможеннаяДекларацияИмпорт.ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И ( ЗначениеРазрешено(Партнер)
	|	ИЛИ ЗначениеРазрешено(Поставщик)
	|	) ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

#Область СлужебныеПроцедурыИФункции

Функция СуммаДокумента(Объект) Экспорт
	Возврат Объект.ТаможенныйСбор + Объект.ТаможенныйШтраф + Объект.Разделы.Итог("СуммаПошлины") + Объект.Разделы.Итог("СуммаНДС");
КонецФункции

// Возвращает параметры указания серий для товаров, указанных в документе
//
// Параметры:
//  Объект - Структура - структура значений реквизитов объекта, необходимых для заполнения параметров указания серий.
//
// Возвращаемое значение:
//  Структура - Состав полей задается в функции ОбработкаТабличнойЧастиКлиентСервер.ПараметрыУказанияСерий.
//
Функция ПараметрыУказанияСерий(Объект) Экспорт
	
	ПараметрыУказанияСерий = НоменклатураКлиентСервер.ПараметрыУказанияСерий();
	
	ПараметрыУказанияСерий.ПолноеИмяОбъекта = "Документ.ТаможеннаяДекларацияИмпорт";
	
	ПараметрыУказанияСерий.ИмяТЧСерии = "Товары";
	ПараметрыУказанияСерий.УчитыватьСебестоимостьПоСериям = ПолучитьФункциональнуюОпцию("УчитыватьСебестоимостьПоСериямСклад", Новый Структура());
	ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры  = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатурыСклад", Новый Структура());
	
	ПараметрыУказанияСерий.СкладскиеОперации.Добавить(Перечисления.СкладскиеОперации.ПустаяСсылка());
	ПараметрыУказанияСерий.ПоляСвязи.Добавить("Склад");
	
	ПараметрыУказанияСерий.ЭтоНакладная = Истина;
	
	ПараметрыУказанияСерий.ТолькоСерииДляСебестоимости = Истина;
	ПараметрыУказанияСерий.Дата = Объект.Дата;
	
	ОперацииТоварыВПути = Новый Массив();
	ОперацииТоварыВПути.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути);
	ОперацииТоварыВПути.Добавить(Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути);
	
	ПараметрыУказанияСерий.ПараметрыЗапроса.Вставить("ХозОперацииТоварыВПути", ОперацииТоварыВПути);
	
	ПараметрыУказанияСерий.ИменаПолейДополнительные.Добавить("ХозяйственнаяОперация");
	
	Возврат ПараметрыУказанияСерий;
	
КонецФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаТаблицасмартСоответствияТаможенныхОписаний(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры 

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Статус КАК Статус
	|ИЗ
	|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";	
	Реквизиты = Запрос.Выполнить().Выгрузить();
		
	Для Каждого Колонка Из Реквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[0][Колонка.Имя]);
	КонецЦикла;
	
КонецПроцедуры 

Функция ТекстЗапросаТаблицасмартСоответствияТаможенныхОписаний(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "смартСоответствияТаможенныхОписаний";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Ссылка КАК Регистратор,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36)) КАК Идентификатор,
	|	Товары.ОписаниеПоДекларации КАК ОписаниеПоДекларации,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Упаковка КАК Упаковка,
	|	&Статус В (ЗНАЧЕНИЕ(Перечисление.смартСтатусыПредварительныхТаможенныхДеклараций.НоменклатураСопоставлена), ЗНАЧЕНИЕ(Перечисление.смартСтатусыПредварительныхТаможенныхДеклараций.ОформлениеРасчетов), ЗНАЧЕНИЕ(Перечисление.смартСтатусыПредварительныхТаможенныхДеклараций.Завершен)) КАК Подтверждено
	|ИЗ
	|	Документ.смартПредварительнаяТаможеннаяДекларацияИмпорт.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции 

#КонецОбласти 

#Область Загрузка 

Функция ПрочитатьИсходныеДанные(АдресДанных, РасширениеФайла) Экспорт
	Результат = ИнициализироватьСтруктуруДляЗаполнения();
	
	ПутьКфайлу = смартПолучитьИмяВременногоФайла(РасширениеФайла);         
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);	
		
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьКФайлу); 
    ПостроительDOM = Новый ПостроительDOM;  
    Документ = ПостроительDOM.Прочитать(ЧтениеXML); 
	
	Если Документ.ПервыйДочерний.ИмяУзла = "ED_Container" Тогда
		ПрочитатьИсходныеДанныеED_Container(Документ, Результат);	
	ИначеЕсли Документ.ПервыйДочерний.ИмяУзла = "AltaGTD" Тогда
		ПрочитатьИсходныеДанныеAltaGTD(Документ, Результат);
	КонецЕсли;
		
	ЧтениеXML.Закрыть();
	УдалитьФайлы(ПутьКфайлу);

	Возврат Результат;
КонецФункции  

Процедура ПрочитатьИсходныеДанныеED_Container(Документ, Результат)
		
	Для Каждого ДочернийУзелДокумент Из Документ.ДочерниеУзлы Цикл
		Если ТипЗнч(ДочернийУзелДокумент) = Тип("КомментарийDOM") И СтрНайти(ДочернийУзелДокумент.ТекстовоеСодержимое, "ND=") > 0 Тогда
			Результат.НомерДекларации = СтрЗаменить(ДочернийУзелДокумент.ТекстовоеСодержимое, "ND=", "");	
		КонецЕсли;
		
		Если ТипЗнч(ДочернийУзелДокумент) = Тип("ЭлементDOM") Тогда
			Для Каждого ДочернийУзелED_Container Из Документ.ЭлементДокумента.ДочерниеУзлы Цикл
				
				Если ИмяУзла(ДочернийУзелED_Container) = "ContainerDoc" Тогда 
					УзелContainerDoc = ДочернийУзелED_Container;
					
					Для Каждого ДочернийУзелContainerDoc Из УзелContainerDoc.ДочерниеУзлы Цикл
						УзелDocBody = ДочернийУзелContainerDoc;
						
						Для Каждого ДочернийУзелDocBody Из УзелDocBody.ДочерниеУзлы Цикл
							УзелESADout_CU = ДочернийУзелDocBody;
							
							Для Каждого ДочернийУзелESADout_CU Из УзелESADout_CU.ДочерниеУзлы Цикл
								
								Если ИмяУзла(ДочернийУзелESADout_CU) = "EECEDocHeaderAddInfo" Тогда
									УзелEECEDocHeaderAddInfo = ДочернийУзелESADout_CU;
									Для Каждого ДочернийУзелEECEDocHeaderAddInfo Из УзелEECEDocHeaderAddInfo.ДочерниеУзлы Цикл
										
										Если ИмяУзла(ДочернийУзелEECEDocHeaderAddInfo) = "EDocDateTime" Тогда
											Результат.Дата = ДатаИзСтроки(ЗначениеУзла(ДочернийУзелEECEDocHeaderAddInfo.ПервыйДочерний));									
										КонецЕсли;
										
									КонецЦикла;	
								КонецЕсли;
								
								Если ИмяУзла(ДочернийУзелESADout_CU) = "ESADout_CUGoodsShipment" Тогда
									УзелESADout_CUGoodsShipment = ДочернийУзелESADout_CU;
									Для Каждого ДочернийУзелESADout_CUGoodsShipment Из УзелESADout_CUGoodsShipment.ДочерниеУзлы Цикл
										
										Если ИмяУзла(ДочернийУзелESADout_CUGoodsShipment) = "ESADout_CUConsignor" Тогда
											УзелESADout_CUConsignor = ДочернийУзелESADout_CUGoodsShipment;
											
											Для Каждого ДочернийУзелESADout_CUConsignor Из УзелESADout_CUConsignor.ДочерниеУзлы Цикл
												
												Если ИмяУзла(ДочернийУзелESADout_CUConsignor) = "OrganizationName" Тогда
													Результат.НаименованиеПоставщика = ЗначениеУзла(ДочернийУзелESADout_CUConsignor);
												КонецЕсли;
												
											КонецЦикла;		
										КонецЕсли;    
										
										Если ИмяУзла(ДочернийУзелESADout_CUGoodsShipment) = "ESADout_CUDeclarant" Тогда
											УзелESADout_CUDeclarant = ДочернийУзелESADout_CUGoodsShipment;
											
											Для Каждого ДочернийУзелESADout_CUDeclarant Из УзелESADout_CUDeclarant.ДочерниеУзлы Цикл
												
												Если ИмяУзла(ДочернийУзелESADout_CUDeclarant) = "RFOrganizationFeatures" Тогда
													УзелRFOrganizationFeatures = ДочернийУзелESADout_CUDeclarant;
													Для Каждого ДочернийУзелRFOrganizationFeatures Из УзелRFOrganizationFeatures.ДочерниеУзлы Цикл
														Если ИмяУзла(ДочернийУзелRFOrganizationFeatures) = "INN" Тогда	
															Результат.ОрганизацияИНН = ЗначениеУзла(ДочернийУзелRFOrganizationFeatures);
														КонецЕсли;												
													КонецЦикла;	
												КонецЕсли;
												
											КонецЦикла;		
										КонецЕсли; 
										
										Если ИмяУзла(ДочернийУзелESADout_CUGoodsShipment) = "ESADout_CUGoods" Тогда
											УзелESADout_CUGoods = ДочернийУзелESADout_CUGoodsShipment;
											
											СтрукутраРаздела = ПолучитьСтруктуруРаздела();
											Результат.Разделы.Добавить(СтрукутраРаздела);
											
											Для Каждого ДочернийУзелESADout_CUGoods Из УзелESADout_CUGoods.ДочерниеУзлы Цикл
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "GoodsNumeric" Тогда
													СтрукутраРаздела.НомерРаздела = ЗначениеУзла(ДочернийУзелESADout_CUGoods);	
												КонецЕсли;    
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "GoodsDescription" Тогда
													СтрукутраРаздела.НаименованиеТоваров = ЗначениеУзла(ДочернийУзелESADout_CUGoods);	
												КонецЕсли; 												
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "GoodsTNVEDCode" Тогда
													СтрукутраРаздела.КодТНВЭД = ЗначениеУзла(ДочернийУзелESADout_CUGoods);	
												КонецЕсли;
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "CustomsCost" Тогда
													СтрукутраРаздела.ТаможеннаяСтоимость = ЗначениеУзла(ДочернийУзелESADout_CUGoods);
												КонецЕсли; 
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "OriginCountryCode" Тогда
													СтрукутраРаздела.КодАльфа2СтраныПроисхожденияТоваровРаздела = ЗначениеУзла(ДочернийУзелESADout_CUGoods);	
												КонецЕсли; 
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "GoodsGroupDescription" Тогда 
													//++ #7812 смарт: Тимофеева 07.08.2026 / Ошибка при загрузке файла в ПТД
													//СтруктураТоварнойПозиции = ПолучитьСтруктуруТоварнойПозиции();
													//
													//УзелGoodsGroupDescription = ДочернийУзелESADout_CUGoods;
													//
													//Для Каждого ДочернийУзелGoodsGroupDescription Из УзелGoodsGroupDescription.ДочерниеУзлы Цикл
													//	Если ИмяУзла(ДочернийУзелGoodsGroupDescription) = "GoodsDescription" Тогда
													//		СтруктураТоварнойПозиции.Описание = СтруктураТоварнойПозиции.Описание + ?(ЗначениеЗаполнено(СтруктураТоварнойПозиции.Описание), " ","")
													//		+ ЗначениеУзла(ДочернийУзелGoodsGroupDescription);													
													//	КонецЕсли;
													//	Если ИмяУзла(ДочернийУзелGoodsGroupDescription) = "GoodsGroupInformation" Тогда
													//		УзелGoodsGroupInformation = ДочернийУзелGoodsGroupDescription;
													//		Для Каждого ДочернийУзелGoodsGroupInformation Из УзелGoodsGroupInformation.ДочерниеУзлы Цикл
													//			Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsMark" Тогда
													//				СтруктураТоварнойПозиции.Марка = ЗначениеУзла(ДочернийУзелGoodsGroupInformation);													
													//			КонецЕсли;
													//			Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsMarking" Тогда
													//				СтруктураТоварнойПозиции.Артикул = ЗначениеУзла(ДочернийУзелGoodsGroupInformation);													
													//			КонецЕсли; 
													//			Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "SerialNumber" Тогда
													//				СтруктураТоварнойПозиции.СерийныеНомера.Добавить(ЗначениеУзла(ДочернийУзелGoodsGroupInformation));													
													//			КонецЕсли;
													//			Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsGroupQuantity" Тогда
													//				УзелGoodsGroupQuantity = ДочернийУзелGoodsGroupInformation;
													//				Для Каждого ДочернийУзелGoodsGroupQuantity Из УзелGoodsGroupQuantity.ДочерниеУзлы Цикл
													//					Если ИмяУзла(ДочернийУзелGoodsGroupQuantity) = "GoodsQuantity" Тогда
													//						СтруктураТоварнойПозиции.Количество = ЗначениеУзла(ДочернийУзелGoodsGroupQuantity);													
													//					КонецЕсли;
													//					Если ИмяУзла(ДочернийУзелGoodsGroupQuantity) = "MeasureUnitQualifierCode" Тогда
													//						СтруктураТоварнойПозиции.КодЕдиницыИзмерения = ЗначениеУзла(ДочернийУзелGoodsGroupQuantity);													
													//					КонецЕсли;
													//				КонецЦикла;
													//			КонецЕсли;
													//		КонецЦикла; 
													//	КонецЕсли;
													//КонецЦикла;   
													//СтруктураТоварнойПозиции.СерийныеНомераСтрокой = СтрСоединить(СтруктураТоварнойПозиции.СерийныеНомера, ", ");
													//СтрукутраРаздела.ТоварныеПозиции.Добавить(СтруктураТоварнойПозиции); 
																													
													УзелGoodsGroupDescription = ДочернийУзелESADout_CUGoods;
													
													ОписаниеGoodsDescription = "";
													Для Каждого ДочернийУзелGoodsGroupDescription Из УзелGoodsGroupDescription.ДочерниеУзлы Цикл
														Если ИмяУзла(ДочернийУзелGoodsGroupDescription) = "GoodsDescription" Тогда
															ОписаниеGoodsDescription = ОписаниеGoodsDescription + ?(ЗначениеЗаполнено(ОписаниеGoodsDescription), " ","")
															+ ЗначениеУзла(ДочернийУзелGoodsGroupDescription);													
														КонецЕсли;
														Если ИмяУзла(ДочернийУзелGoodsGroupDescription) = "GoodsGroupInformation" Тогда 
															
															СтруктураТоварнойПозиции = ПолучитьСтруктуруТоварнойПозиции();
															СтруктураТоварнойПозиции.Описание = ОписаниеGoodsDescription;
															
															УзелGoodsGroupInformation = ДочернийУзелGoodsGroupDescription;
															Для Каждого ДочернийУзелGoodsGroupInformation Из УзелGoodsGroupInformation.ДочерниеУзлы Цикл
																Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsMark" Тогда
																	СтруктураТоварнойПозиции.Марка = ЗначениеУзла(ДочернийУзелGoodsGroupInformation);													
																КонецЕсли;
																Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsMarking" Тогда
																	СтруктураТоварнойПозиции.Артикул = ЗначениеУзла(ДочернийУзелGoodsGroupInformation);													
																КонецЕсли; 
																Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "SerialNumber" Тогда
																	СтруктураТоварнойПозиции.СерийныеНомера.Добавить(ЗначениеУзла(ДочернийУзелGoodsGroupInformation));													
																КонецЕсли;
																Если ИмяУзла(ДочернийУзелGoodsGroupInformation) = "GoodsGroupQuantity" Тогда
																	УзелGoodsGroupQuantity = ДочернийУзелGoodsGroupInformation;
																	Для Каждого ДочернийУзелGoodsGroupQuantity Из УзелGoodsGroupQuantity.ДочерниеУзлы Цикл
																		Если ИмяУзла(ДочернийУзелGoodsGroupQuantity) = "GoodsQuantity" Тогда
																			СтруктураТоварнойПозиции.Количество = ЗначениеУзла(ДочернийУзелGoodsGroupQuantity);													
																		КонецЕсли;
																		Если ИмяУзла(ДочернийУзелGoodsGroupQuantity) = "MeasureUnitQualifierCode" Тогда
																			СтруктураТоварнойПозиции.КодЕдиницыИзмерения = ЗначениеУзла(ДочернийУзелGoodsGroupQuantity);													
																		КонецЕсли;
																	КонецЦикла;
																КонецЕсли;
															КонецЦикла; 
															СтруктураТоварнойПозиции.СерийныеНомераСтрокой = СтрСоединить(СтруктураТоварнойПозиции.СерийныеНомера, ", ");
															СтрукутраРаздела.ТоварныеПозиции.Добавить(СтруктураТоварнойПозиции);
															
														КонецЕсли;
													КонецЦикла;	
													//-- #7812 смарт: Тимофеева 07.08.2026
												КонецЕсли;
												
												Если ИмяУзла(ДочернийУзелESADout_CUGoods) = "ESADout_CUCustomsPaymentCalculation" Тогда
													УзелESADout_CUCustomsPaymentCalculation = ДочернийУзелESADout_CUGoods; 
													
													КодПлатежа 		= "";
													СуммаПлатежа 	= 0;
													Ставка 			= "";
													ВидСтавки 		= "";
													Для Каждого ДочернийУзелESADout_CUCustomsPaymentCalculation Из УзелESADout_CUCustomsPaymentCalculation.ДочерниеУзлы Цикл
														Если ИмяУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation) = "PaymentModeCode" Тогда
															КодПлатежа = ЗначениеУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation);													
														КонецЕсли;
														Если ИмяУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation) = "PaymentAmount" Тогда
															СуммаПлатежа = ЗначениеУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation);													
														КонецЕсли;
														Если ИмяУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation) = "Rate" Тогда
															Ставка = ЗначениеУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation);													
														КонецЕсли;
														Если ИмяУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation) = "RateTypeCode" Тогда
															ВидСтавки = ЗначениеУзла(ДочернийУзелESADout_CUCustomsPaymentCalculation);													
														КонецЕсли;
													КонецЦикла; 
													
													Если КодПлатежа = "1010" Тогда
														Результат.ТаможенныйСбор = СуммаПлатежа;
													КонецЕсли;
													
													Если КодПлатежа = "2010" Тогда
														СтрукутраРаздела.СуммаПошлины = СуммаПлатежа;
														СтрукутраРаздела.СтавкаПошлины = Ставка;
														СтрукутраРаздела.ВидСтавкиПошлины = ВидСтавки;
													КонецЕсли;
													
													//++ #6094 смарт: Тимофеева 17.03.26 / Документ "Предварительная таможенная декларация". Доработки заполнения и гарантии
													Если КодПлатежа = "2050" Тогда
														Если СтрукутраРаздела.ВидСтавкиПошлины = ВидСтавки Тогда
															Попытка
																СуммаПошлиныРаздела = Число(СтрукутраРаздела.СуммаПошлины);
																СтавкаПошлиныРаздела = Число(СтрукутраРаздела.СтавкаПошлины);
															
																СтрукутраРаздела.СуммаПошлины = СуммаПошлиныРаздела + СуммаПлатежа;
																СтрукутраРаздела.СтавкаПошлины = СтавкаПошлиныРаздела + Ставка;
															Исключение
															КонецПопытки;
														Иначе
															//ToDo
														КонецЕсли;
													КонецЕсли; 
													//-- #6094 смарт: Тимофеева 17.03.26
													
													Если КодПлатежа = "5010" Тогда
														СтрукутраРаздела.СтавкаНДС = Ставка;
														СтрукутраРаздела.СуммаНДС = СуммаПлатежа;
													КонецЕсли; 										
													
												КонецЕсли;										
											КонецЦикла;	
										КонецЕсли;								
									КонецЦикла;								
								КонецЕсли;  					
							КонецЦикла;					
						КонецЦикла;	   			
					КонецЦикла;
				КонецЕсли; 		
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция смартПолучитьИмяВременногоФайла(РасширениеФайла)
	Возврат ПолучитьИмяВременногоФайла(РасширениеФайла);	
	//Возврат СтрШаблон("/home/exchange/timofeeva/GTD_%1.%2", Строка(Новый УникальныйИдентификатор), РасширениеФайла);
КонецФункции 

Функция ИмяУзла(Узел)
	Возврат СтрЗаменить(Узел.ИмяУзла, Узел.Префикс + ":", ""); 	
КонецФункции 

Функция ЗначениеУзла(Узел) 
	Если ТипЗнч(Узел) = Тип("ТекстDOM") Тогда
		Возврат Узел.ЗначениеУзла;
	Иначе
		Возврат Узел.ПервыйДочерний.ЗначениеУзла; 
	КонецЕсли;
КонецФункции 

Функция ИнициализироватьСтруктуруДляЗаполнения()
	Результат = Новый Структура; 
	
	Результат.Вставить("НаименованиеПоставщика",		""); 
	Результат.Вставить("ОрганизацияИНН",				"");

	Результат.Вставить("НомерДекларации", 				"");
	Результат.Вставить("Дата", 		   		 			"");
	Результат.Вставить("ТаможенныйСбор",   		 		"");
	Результат.Вставить("КодАльфа2СтраныПроисхождения",  ""); 
	Результат.Вставить("Валюта",  						ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	Результат.Вставить("Разделы",		 		 		Новый Массив ); 
	Возврат Результат; 	
КонецФункции 

Функция ПолучитьСтруктуруРаздела()
	Результат = Новый Структура; 
	Результат.Вставить("НомерРаздела",		 							""); 
	Результат.Вставить("НаименованиеТоваров",		 					""); 
	Результат.Вставить("КодАльфа2СтраныПроисхожденияТоваровРаздела", 	"");
	Результат.Вставить("ТаможеннаяСтоимость", 					 		"");
	
	Результат.Вставить("СтавкаПошлины",					 		 		"");
	Результат.Вставить("ВидСтавкиПошлины",				 		 		"");
	Результат.Вставить("СуммаПошлины",					 		 		"");
	Результат.Вставить("СтавкаНДС",					 		 			"");
	Результат.Вставить("СуммаНДС",					 		 			"");
	
	Результат.Вставить("ТоварныеПозиции",				 		   		Новый Массив);
	
	Результат.Вставить("КодТНВЭД",				 	""); 
	Результат.Вставить("Документы",				 	Новый Массив); 
	
	Возврат Результат; 	
КонецФункции // ПолучитьСтруктуруРаздела

Функция ПолучитьСтруктуруТоварнойПозиции()
	Результат = Новый Структура;
	Результат.Вставить("Описание", 		   		"");
	Результат.Вставить("Марка", 		   		"");
	Результат.Вставить("Артикул", 		   		"");
	Результат.Вставить("СерийныеНомера", 		Новый Массив);
	Результат.Вставить("СерийныеНомераСтрокой", "");
	
	Результат.Вставить("Количество",		 	""); 
	Результат.Вставить("КодЕдиницыИзмерения",	"");
	
	Результат.Вставить("Вес",				 	"");
	Результат.Вставить("КодТНВЭД",				""); 
	
	Возврат Результат; 	
КонецФункции 

Функция ДатаИзСтроки(ЗначениеСтрокой)
	Результат = Дата(1,1,1); 
	ДатаСтрокой = СтрЗаменить(ЗначениеСтрокой, "-","");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, ":","");
	ДатаСтрокой = СтрЗаменить(ДатаСтрокой, "T","");
	Если СтрНайти(ДатаСтрокой, "+") > 0 Тогда
		ДатаСтрокой = Лев(ДатаСтрокой, СтрНайти(ДатаСтрокой, "+") - 1);
	КонецЕсли;
	Попытка
		Результат = Дата(ДатаСтрокой);
	Исключение
	КонецПопытки;
	
	Возврат Результат;
КонецФункции 

Функция ПолучитьДатуПоНомеруДекларации(ПолныйНомерГТД)
	ДатаГТДСтрока 	= Сред(ПолныйНомерГТД, СтрНайти(ПолныйНомерГТД,"/")+1,6);
	День 			= Число(Лев(ДатаГТДСтрока, 2));
	Месяц			= Число(Сред(ДатаГТДСтрока, 3, 2));
	Год  			= 2000 + Число(Сред(ДатаГТДСтрока, 5));
	Возврат Дата(Год,Месяц,День); 	
КонецФункции 

Процедура ПрочитатьИсходныеДанныеAltaGTD(Документ, Результат)
	
	Для Каждого ДочернийУзелAltaGTD Из Документ.ЭлементДокумента.ДочерниеУзлы Цикл
		Если ДочернийУзелAltaGTD.ИмяУзла = "G_2_NAM" Тогда
			Результат.НаименованиеПоставщика = ДочернийУзелAltaGTD.ТекстовоеСодержимое;
		КонецЕсли;
		
		Если ДочернийУзелAltaGTD.ИмяУзла = "REGNUM" Тогда
			Результат.НомерДекларации 	= ДочернийУзелAltaGTD.ТекстовоеСодержимое;
			Результат.Дата	 			= ПолучитьДатуПоНомеруДекларации(Результат.НомерДекларации);
		КонецЕсли;
		
		ТекущийКодВидаПлатежа = "";
		Если ДочернийУзелAltaGTD.ИмяУзла = "BLOCK" Тогда
			СтрукутраРаздела = ПолучитьСтруктуруРаздела();
			
			Для Каждого ДочернийУзелBLOCK Из ДочернийУзелAltaGTD.ДочерниеУзлы Цикл
				Если ДочернийУзелBLOCK.ИмяУзла = "G_31" Тогда
					Для Каждого ДочернийУзелG_31 Из ДочернийУзелBLOCK.ДочерниеУзлы Цикл
						Если ДочернийУзелG_31.ИмяУзла = "NAME" Тогда
							СтрукутраРаздела.НаименованиеТоваров = СтрЗаменить(СтрЗаменить(ДочернийУзелBLOCK.ТекстовоеСодержимое, Символы.ПС, " "), "  ", " ");
						КонецЕсли; 
					КонецЦикла;
				КонецЕсли;
				Если ДочернийУзелBLOCK.ИмяУзла = "G_32_1" Тогда
					СтрукутраРаздела.НомерРаздела = ДочернийУзелBLOCK.ТекстовоеСодержимое;
				КонецЕсли;
				Если ДочернийУзелBLOCK.ИмяУзла = "G_34_1" Тогда
					СтрукутраРаздела.КодАльфа2СтраныПроисхожденияТоваровРаздела = ДочернийУзелBLOCK.ТекстовоеСодержимое;
				КонецЕсли;
				Если ДочернийУзелBLOCK.ИмяУзла = "G_33_1" Тогда
					СтрукутраРаздела.КодТНВЭД = ДочернийУзелBLOCK.ТекстовоеСодержимое;
				КонецЕсли;
				Если ДочернийУзелBLOCK.ИмяУзла = "G_45_0" Тогда
					СтрукутраРаздела.ТаможеннаяСтоимость = ДочернийУзелBLOCK.ТекстовоеСодержимое;
				КонецЕсли;  				
				
				Если Лев(ДочернийУзелBLOCK.ИмяУзла, 5) = "G_47_" Тогда
					ТекстовоеСодержимое = ДочернийУзелBLOCK.ТекстовоеСодержимое;
					
					Если ТекущийКодВидаПлатежа = "" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "1" Тогда
						ТекущийКодВидаПлатежа = ТекстовоеСодержимое;	
					ИначеЕсли ТекущийКодВидаПлатежа = "1010" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "4" Тогда
						Результат.ТаможенныйСбор = ТекстовоеСодержимое;
					ИначеЕсли ТекущийКодВидаПлатежа = "2010" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "3" Тогда
						СтрукутраРаздела.ВидСтавкиПошлины = "%";
						СтрукутраРаздела.СтавкаПошлины = СтрЗаменить(ТекстовоеСодержимое,"%","");
					ИначеЕсли ТекущийКодВидаПлатежа = "2010" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "4" Тогда
						СтрукутраРаздела.СуммаПошлины = ТекстовоеСодержимое;
					ИначеЕсли ТекущийКодВидаПлатежа = "5010" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "3" Тогда
						СтрукутраРаздела.СтавкаНДС = СтрЗаменить(ТекстовоеСодержимое,"%","");
					ИначеЕсли ТекущийКодВидаПлатежа = "5010" И Прав(ДочернийУзелBLOCK.ИмяУзла, 1) = "4" Тогда
						СтрукутраРаздела.СуммаНДС = ТекстовоеСодержимое;
					ИначеЕсли ТекстовоеСодержимое = "ИУ" Или ТекстовоеСодержимое = "HS" Тогда
						ТекущийКодВидаПлатежа = "";	
					КонецЕсли;  
				КонецЕсли;
				
				Если ДочернийУзелBLOCK.ИмяУзла = "TOVG" Тогда
					СтруктураТоварнойПозиции = ПолучитьСтруктуруТоварнойПозиции();
					Для Каждого ДочернийУзелTOVG Из ДочернийУзелBLOCK.ДочерниеУзлы Цикл
						Если ДочернийУзелTOVG.ИмяУзла = "G31_1" Тогда
							СтруктураТоварнойПозиции.Описание = СтруктураТоварнойПозиции.Описание + ?(ЗначениеЗаполнено(СтруктураТоварнойПозиции.Описание), " ","")
																						+ ДочернийУзелTOVG.ТекстовоеСодержимое;
						ИначеЕсли ДочернийУзелTOVG.ИмяУзла = "G31_15" Тогда
							Артикул = ДочернийУзелTOVG.ТекстовоеСодержимое;
							СтруктураТоварнойПозиции.Артикул = Артикул;
						ИначеЕсли ДочернийУзелTOVG.ИмяУзла = "KOLVO" Тогда
							СтруктураТоварнойПозиции.Количество = ДочернийУзелTOVG.ТекстовоеСодержимое;
						ИначеЕсли ДочернийУзелTOVG.ИмяУзла = "G31_38" Тогда
							СтруктураТоварнойПозиции.Вес = ДочернийУзелTOVG.ТекстовоеСодержимое;						
						ИначеЕсли ДочернийУзелTOVG.ИмяУзла = "G31_14" Тогда
							СтруктураТоварнойПозиции.Марка = СокрЛП(ДочернийУзелTOVG.ТекстовоеСодержимое);	
						ИначеЕсли ДочернийУзелTOVG.ИмяУзла = "CODE_EDI" Тогда
							СтруктураТоварнойПозиции.КодЕдиницыИзмерения = СокрЛП(ДочернийУзелTOVG.ТекстовоеСодержимое);	
							
							//Результат.Вставить("СерийныеНомера", 		Новый Массив);
							//Результат.Вставить("СерийныеНомераСтрокой", "");
							
						КонецЕсли;
					КонецЦикла;
					СтрукутраРаздела.ТоварныеПозиции.Добавить(СтруктураТоварнойПозиции); 
					
				КонецЕсли; 
			КонецЦикла;
			Результат.Разделы.Добавить(СтрукутраРаздела);
		КонецЕсли;
	КонецЦикла;   	
КонецПроцедуры

#КонецОбласти    

#КонецОбласти

#КонецЕсли
